app/controllers/city_select_controller.rb

SELECT `areas`.`updated_at` FROM `areas` ORDER BY name
---
  def index
    expires_in 1.hours, public: true
    @areas = Area.order('name')