app/controllers/events_controller.rb

  def show
    if stale?(etag: Event.where(uuid: params[:uuid]).pluck(:updated_at).first, last_modified: Event.where(uuid: params[:uuid]).pluck(:updated_at).first, public: true)
      @event = Event.includes_photos.where(uuid: params[:uuid]).first
---
SELECT `events`.`updated_at` FROM `events` WHERE `events`.`uuid` = x'37623164323064652d633835332d343465372d613338342d323836633766383461636535'
SELECT  `events`.* FROM `events` WHERE `events`.`uuid` = x'37623164323064652d633835332d343465372d613338342d323836633766383461636535' ORDER BY `events`.`id` ASC LIMIT 1