app/controllers/future_events_controller.rb

  def index
    if stale?(etag: Event.in_area(@current_area).in_the_next_month.pluck(:updated_at), public: true)
      @events = Event.in_area(@current_area).in_the_next_month.order(:start_time).group("DATE(start_time)").count
---
SELECT COUNT(*) AS count_all, DATE(start_time) AS date_start_time FROM `events` WHERE `events`.`area` = 'berlin' AND `events`.`start_time` BETWEEN '2018-07-26 06:00:00' AND '2018-08-24 05:59:59' GROUP BY DATE(start_time) ORDER BY `events`.`start_time` ASC