app/controllers/upload_controller.rb

SELECT  `events`.* FROM `events` WHERE `events`.`eid` = '212198186153276' LIMIT 1
SELECT  `events`.* FROM `events` ORDER BY `events`.`id` DESC LIMIT 1
---
    end

    # Try to find Token in current events
    event              = Event.find_by(eid: @token.token) || Event.new
    event.name         = result['name'].split('@').first if result['name']

SELECT  `cities`.* FROM `cities` WHERE `cities`.`name` = 'Düsseldorf' LIMIT 1
SELECT `cities`.`name` FROM `cities`
---
      event.country   = result['place']['location']['country'] if result['place']['location']['country']
    end

    event.area = City.find_by(name: event.city).area.domain if City.find_by(name: event.city)

    city_names = City.pluck(:name).join('|')

SELECT `block_word_titles`.* FROM `block_word_titles`
---
    end

    # look out for block words
    for word in BlockWordTitle.all

SELECT `block_word_descriptions`.* FROM `block_word_descriptions`
---
      end
    end

    for word in BlockWordDescription.all

SELECT `block_word_locations`.* FROM `block_word_locations`
---
      end
    end

    for word in BlockWordLocation.all

SELECT COUNT(*) FROM `events` WHERE `events`.`id` IS NOT NULL AND `events`.`city` = 'Berlin' AND (start_time > '2018-07-23 15:30:00') AND (start_time < '2018-07-23 16:30:00') AND (location like '%Berlin%')
SELECT  `events`.* FROM `events` WHERE `events`.`id` IS NOT NULL AND `events`.`city` = 'Berlin' AND (start_time > '2018-07-23 15:30:00') AND (start_time < '2018-07-23 16:30:00') AND (location like '%Berlin%') ORDER BY `events`.`id` ASC LIMIT 1
---

    #   # lock out for doubles
    if event.location
      candidate_count = Event.where.not(id: event.id).where(city: event.city).where('start_time > ?', (event.start_time - 30.minutes)).where('start_time < ?', (event.start_time + 30.minutes)).where("location like ?", "%#{event.location}%").count

      if candidate_count > 0
        @candidate = Event.where.not(id: event.id).where(city: event.city).where('start_time > ?', (event.start_time - 30.minutes)).where('start_time < ?', (event.start_time + 30.minutes)).where("location like ?", "%#{event.location}%").first

INSERT INTO `events` (`photo_id`, `uuid`, `eid`, `name`, `location`, `street`, `zipcode`, `city`, `area`, `country`, `website`, `start_time`, `description_html`, `facebook_image_url`, `updated_at`, `created_at`, `description_amp`) VALUES (31, x'37623164323064652d633835332d343465372d613338342d323836633766383461636535', '1689734421152873', 'Tester vala evenet', 'Mumbai', 'CHEMBUR', '400071', 'Mumbai', 'mumbai', 'India', 'https://www.facebook.com/events/1689734421152873', '2018-07-25 10:30:00', '', 'https://scontent.xx.fbcdn.net/v/t1.0-9/37743365_458263337971581_6216659458072772608_n.jpg?_nc_cat=0&oh=0c84d5be3adcf4e54e64940c957fe16d&oe=5C0BFCDB', '2018-07-25 10:15:47', '2018-07-25 10:15:47', '')
---
      Dir.mkdir("#{Rails.root}/tmp/facebook_images") unless File.exist?("#{Rails.root}/tmp/facebook_images")
      response = Typhoeus::Request.get(event.facebook_image_url)
      tmp_path = Rails.root.to_s + "/tmp/facebook_images/#{SecureRandom.uuid()}"
      File.open(tmp_path, 'wb') {|file| file << response.body }

UPDATE `events` SET `description` = 'chota sa descriptiuon', `photo_id` = 32, `description_html` = '<p>chota sa descriptiuon</p>\n', `updated_at` = '2018-07-25 10:17:04', `description_amp` = '<p>chota sa descriptiuon</p>\n' WHERE `events`.`id` = 12
---
    end

    begin
      if event.save

SELECT  `events`.* FROM `events` WHERE `events`.`eid` = '268628833747889' LIMIT 1
---
    end

    # Try to find Token in current events
    event              = Event.find_by(eid: @token.token) || Event.new

SELECT  `cities`.* FROM `cities` WHERE `cities`.`name` IS NULL LIMIT 1
SELECT `cities`.`name` FROM `cities`
---
      event.country   = result['place']['location']['country'] if result['place']['location']['country']
    end

    event.area = City.find_by(name: event.city).area.domain if City.find_by(name: event.city)

    city_names = City.pluck(:name).join('|')